# Функция choose_plural() 🌶️🌶️
# Реализуйте функцию choose_plural(), которая принимает два аргумента в следующем порядке:
# amount — натуральное число, количество
# declensions — кортеж из трех вариантов склонения существительного
# Функция должна возвращать строку, полученную путем объединения подходящего существительного из кортежа
# declensions и количества amount, в следующем формате:
# <количество> <существительное>
# Примечание 1. Передаваемый в функцию кортеж легко составить по мнемоническому правилу: один, два, пять. Например:
# для слова «арбуз»: арбуз, арбуза, арбузов
# для слова «рубль»: рубль, рубля, рублей

# пока не решено